released/MS51_RGBLED/Sample_Code/Template/Project/main.c
};
#endif 

void delay(uint16_t dly)
{
/*
	delay(100) : 68.19 us
	delay(200) : 134 us
	delay(300) : 220 us
	delay(400) : 287 us	
	delay(400) : 287 us	
	delay(450) : 321 us		
	delay(500) : 354 us	
	
	delay(1500) : 1ms	
*/


	while( dly--);
}

void delay_ms(uint16_t ms)
{
	uint16_t i = 0 ;
	for (i=0;i<ms;i++)
	{
		delay(MS_1MS);
	}
}

#if defined (ENABLE_GPIO_TRIG_LED)
void GPIO_WS2812C_DATA1(void)
{				
	P00 = 1;
	nop;nop;nop;nop;nop;
	nop;nop;nop;nop;nop;
	nop;nop;nop;nop;nop;
	
	P00 = 0;
	nop;nop;nop;nop;nop;
}

void GPIO_WS2812C_DATA0(void)
{	
	P00 = 1;
	nop;nop;nop;nop;nop;
			
	P00 = 0;
	nop;nop;nop;nop;nop;
	nop;nop;nop;nop;nop;	
}

void GPIO_WS2812C_Send_1Bye(uint8_t Data)
{
	uint8_t i = 0;

	for (i = 0; i < 8; i ++)
	{
		if (Data & 0x80)
		{
			GPIO_WS2812C_DATA1();
		}
		else
		{
			GPIO_WS2812C_DATA0();
		}
		Data <<= 1;	
	} 	
}


void GPIO_WS2812C_Send_1bit(uint8_t Data)
{
//	P13 = 1;		
	switch(Data)	//	nop; 225ns
	{
		case 0: 
			GPIO_WS2812C_DATA0();				
			break;
		default:
			GPIO_WS2812C_DATA1();
			break;
	}
//	P13 = 0;	
}

void GPIO_WS2812C_Initial(void)
{      
	P00_PUSHPULL_MODE;														// P00 (MOSI) Quasi mode

}

#endif

#if defined (ENABLE_SPI_TRIG_LED)
void SPI_Send_Data(uint8_t Data)	//check SPIOVF for FIFO
{
#if 1    

    while(SPSR & SET_BIT2);
    SPDR = Data;  
#else
    SPDR = Data;                       
    while(!(SPSR & SET_BIT7));
    clr_SPIF;
#endif 
}

void SPI_Send_1bit(uint8_t Data)
{
	/* Send SPI1 data */
	switch(Data)
	{
		case 0:       
			SPI_Send_Data(WS_SPI_LOW);  
			break;
		default:      
			SPI_Send_Data(WS_SPI_HIGH);  
			break;
	}
}

void SPI_Initial(uint8_t idx)
{      
	P15_QUASI_MODE;														// P15 (SS) Quasi mode
	P10_QUASI_MODE;														// P10 (SPCLK) Quasi mode
	P00_QUASI_MODE;														// P00 (MOSI) Quasi mode
//	P01_QUASI_MODE;														// P22 (MISO) Quasi mode
    
    set_DISMODF;                                							// SS General purpose I/O ( No Mode Fault ) 
//    clr_SSOE;
    set_SSOE;																// Automatic SS output 
   
    clr_LSBFE;                                  								// MSB first         

    clr_CPOL;                                   								// The SPI clock is low in idle mode
//	set_CPOL;
    set_CPHA;                                   								// The data is sample on the second edge of SPI clock 
    
    set_MSTR;                                   							// SPI in Master mode 

	//TRM page 90
//    SPICLK_DIV2;                        									// Select SPI clock 
	switch(idx)
	{
		case SPI_12M: 
			SPICLK_DIV2;
			break;
		case SPI_6M: 
			SPICLK_DIV4;
			break;	
		case SPI_3M: 
			SPICLK_DIV8;																// set to SPI 3M
			break;
		case SPI_1_5M: 
			SPICLK_DIV16;
			break;				
	}

	set_SPIEN;                                  								// Enable SPI function 
    clr_SPIF;
}
#endif

#if defined (ENABLE_PWM_TRIG_LED)
void PWM_ISR (void) interrupt 13
{
    clr_PWMCON0_PWMF;               // clear PWM interrupt flag
	clr_EIE_EPWM;
	if (LOAD == 0)
	{		
		clr_PWMCON0_PWMRUN;	
	}
}

void PWMx_CHx_SetDuty(uint16_t d)
{
	uint16_t res = 0 ;
	//USE interrupt ?
    PWM_INT_PWM0;  
    PWM_RISING_INT; 
    set_EIE_EPWM;                  /*Enable PWM interrupt  */
    ENABLE_GLOBAL_INTERRUPT; 
	
	res = d*(MAKEWORD(PWMPH,PWMPL)+1)/100;

    PWM0H = HIBYTE(res);
    PWM0L = LOBYTE(res);

    set_PWMCON0_LOAD;
    set_PWMCON0_PWMRUN;	
}

void PWMx_CHx_Init(void)
{
	uint16_t res = 0;

	P12_PUSHPULL_MODE;
    PWM0_P12_OUTPUT_ENABLE;
	
    PWM_IMDEPENDENT_MODE;
    PWM_CLOCK_DIV_2;

//	clr_PWMCON0_PWMRUN;
	
/*
	PWM frequency   = Fpwm/((PWMPH,PWMPL)+1) = (24MHz/2)/((PWMPH,PWMPL)+1) = 800KHz
*/	
	res = (SYS_CLOCK >> 1)/WS_PWM_FREQ - 1;
//	printf("%d\r\n" , res);

	PWMPH = HIBYTE(res);	//HIBYTE((SYS_CLOCK>>1)/uFrequency-1);
    PWMPL = LOBYTE(res);	//LOBYTE((SYS_CLOCK>>1)/uFrequency-1);

//	PWMx_CHx_SetDuty(0);

}
#endif


/*
	DATA COLLECT CPU : 
	18 LED : 3.468 ms
	17 LED : 3.287 ms
	10 LED : 1.947 ms	, latch : 602
	5 LED : 0.965 ms	, latch : 324
	4 LED : 0.784 ms	, latch : 254	
	3 LED : 0.591 ms	, latch : 192
	2 LED : 0.401 ms	, latch : 134	
	1 LED : 0.210 ms	, latch : 79		
*/

void setLED_ResetPulse(uint8_t pos)	//target : 280us
{
	uint16_t i = 0 ;

	#if defined (ENABLE_PWM_TRIG_LED)
	if (pos == WS_RES_POS_FRONT)	//57 us
	{
		for (i = 0 ; i < 7 ; i++)	
		{
			PWMx_CHx_SetDuty(0x00);
		}
	}
	else
	{
		for (i = 0 ; i < 40 ; i++)		//317 us
		{
			PWMx_CHx_SetDuty(0x00);
		}
	}
	#elif defined (ENABLE_SPI_TRIG_LED)	
	if (pos == WS_RES_POS_FRONT)	//57 us
	{
		delay(100);
	}
	else
	{
		delay(MS_LED_LATCH);
	}
	#elif defined (ENABLE_GPIO_TRIG_LED)
	P00 = 0;
	
	if (pos == WS_RES_POS_FRONT)	//57 us
	{
		delay(100);
	}
	else
	{
		delay(MS_LED_LATCH);
	}
	#endif

}

void setLED_Display(uint16_t DataCount)
{
	uint16_t Count = DataCount;

#if defined (ENABLE_PWM_TRIG_LED)	// PWM unable to stop per 24 bit data
	uint16_t i = 0;
	setLED_ResetPulse(WS_RES_POS_FRONT);

	for(i = 0; i < DataCount ;i++ )
	{	
//		P13 = 1;
		PWMx_CHx_SetDuty(DataBuffer[i]);
//		P13 = 0;
	}
	
	setLED_ResetPulse(WS_RES_POS_BACK); 
#elif defined (ENABLE_SPI_TRIG_LED)	// SPI unable to keep pull low under 8 bit clock , unless use DMA
	uint8_t i = 0;
	signed int j = 0;
	
	setLED_ResetPulse(WS_RES_POS_FRONT);	
	for(i=0;i<(LED_NUM);i++)
	{
//		P13 = 1 ;
		for(j=7;j>=0;j--)  
		{
			SPI_Send_1bit(DataBuffer[i*3]  &(1<<j));
		}
		for(j=7;j>=0;j--)  
		{
			SPI_Send_1bit(DataBuffer[i*3+1]&(1<<j));
		}
		for(j=7;j>=0;j--)  
		{
			SPI_Send_1bit(DataBuffer[i*3+2]&(1<<j));
		}
//		P13 = 0;
	}
	setLED_ResetPulse(WS_RES_POS_BACK);
#elif defined (ENABLE_GPIO_TRIG_LED)
	uint8_t i = 0;
//	signed int j = 0;
	
	setLED_ResetPulse(WS_RES_POS_FRONT);
	#if 1
//	P13 = 1;	
	for(i=0;i<(LED_NUM);i++)
	{
		GPIO_WS2812C_Send_1Bye(DataBuffer[i*3]);
		GPIO_WS2812C_Send_1Bye(DataBuffer[i*3+1]);
		GPIO_WS2812C_Send_1Bye(DataBuffer[i*3+2]);		
	}


	#else
	for(i=0;i<(LED_NUM);i++)
	{
		for(j=7;j>=0;j--)  
		{
			GPIO_WS2812C_Send_1bit(DataBuffer[i*3]  &(1<<j));
		}
		for(j=7;j>=0;j--)  
		{
			GPIO_WS2812C_Send_1bit(DataBuffer[i*3+1]&(1<<j));
		}
		for(j=7;j>=0;j--)  
		{
			GPIO_WS2812C_Send_1bit(DataBuffer[i*3+2]&(1<<j));
		}
		
