released/MS51_RGBLED/Sample_Code/Template/Project/main.c
	}
	#endif
//	P13 = 0;	
	setLED_ResetPulse(WS_RES_POS_BACK);


#endif
}

void setLED_BufferClear(void)
{
	memset(DataBuffer,0x00,LED_DATA_LEN);
}

void setLED_Color(uint8_t DeviceNumber ,uint8_t RED, uint8_t GREEN, uint8_t BLUE)	// Output a colour Format: GGRRBB	
{
	uint16_t index = 0;	
	uint8_t i = 0;
	#if defined (ENABLE_SPI_TRIG_LED) | defined (ENABLE_GPIO_TRIG_LED)	
	DataBuffer[DeviceNumber*3]   = GREEN;
	DataBuffer[DeviceNumber*3+1] = RED;
	DataBuffer[DeviceNumber*3+2] = BLUE;

	#elif defined (ENABLE_PWM_TRIG_LED)
	for	(i=0; i<8; i++) 	// GREEN data
	{
		DataBuffer[index + DeviceNumber*24] = ((GREEN<<i) & 0x80)?(WS_PWM_HIGH):(WS_PWM_LOW);
		index++ ;
	}
	for	(i=0; i<8; i++) 	// RED
	{
		DataBuffer[index + DeviceNumber*24] = ((RED<<i) & 0x80)?(WS_PWM_HIGH):(WS_PWM_LOW);
		index++ ;
	}
	for	(i=0; i<8; i++) 	// BLUE
	{
		DataBuffer[index + DeviceNumber*24] = ((BLUE<<i) & 0x80)?(WS_PWM_HIGH):(WS_PWM_LOW);
		index++ ;
	}
	#endif
}

void setLED_ColorWipe(uint8_t RED, uint8_t GREEN, uint8_t BLUE) 
{
	uint8_t index = 0 ;

	for (index = 0; index < LED_NUM; index++)
	{
		setLED_Color(index, RED, GREEN, BLUE);
	}

	setLED_Display(LED_DATA_LEN);
}

//https://github.com/fduignan/NucleoF042_SingleWS2812B/blob/master/main.c
void _stripEffect_Rainbow(uint8_t* RED, uint8_t* GREEN, uint8_t* BLUE)	
{   
	// Cycle through the colours of the rainbow (non-uniform brightness however)
	// Inspired by : http://academe.co.uk/2012/04/arduino-cycling-through-colours-of-the-rainbow/
	
	static uint8_t Red = 255;
	static uint8_t Green = 0;
	static uint8_t Blue = 0;
	static uint8_t State = 0;
	switch (State)
	{
		case 0:{
			Green++;
			if (Green == 255)
				State = 1;
			break;
		}
		case 1:{
			Red--;
			if (Red == 0)
				State = 2;
			break;
		}
		case 2:{
			Blue++;
			if (Blue == 255)
				State = 3;			
			break;
		}
		case 3:{
			Green--;
			if (Green == 0)
				State = 4;
			break;
		}
		case 4:{
			Red++;
			if (Red == 255)
				State = 5;
			break;
		}
		case 5:{
			Blue --;
			if (Blue == 0)
				State = 0;
			break;
		}		
	}

	*GREEN = Green;
	*RED = Red;
	*BLUE = Blue;	
//	return (Green << 16) + (Red << 8) + Blue;


}

uint8_t _stripEffect_Wheel(uint8_t WheelPos , uint8_t* RED, uint8_t* GREEN, uint8_t* BLUE) 
{
	WheelPos = 255 - WheelPos;
	if(WheelPos < 85) 
	{
		*GREEN = 0;
		*RED = 255 - WheelPos * 3;
		*BLUE = WheelPos * 3;
		return 0;
		
//		return PACK_RGB(255 - WheelPos * 3, 0, WheelPos * 3);
	}
	if(WheelPos < 170) 
	{
		WheelPos -= 85;

		*GREEN = WheelPos * 3;
		*RED = 0;
		*BLUE = 255 - WheelPos * 3;
		return 0;
		
//		return PACK_RGB(0, WheelPos * 3, 255 - WheelPos * 3);
	}
	
	WheelPos -= 170;

	*GREEN = 255 - WheelPos * 3;
	*RED = WheelPos * 3;
	*BLUE = 0;
	return 0;
	
//	return PACK_RGB(WheelPos * 3, 255 - WheelPos * 3, 0);
}

//void getFromAToB(uint16_t time, uint16_t steps, 
//		uint8_t redA,	uint8_t greenA, uint8_t blueA, 
//		uint8_t redB, uint8_t greenB, uint8_t blueB) 
//{
//	uint16_t i = 0;
//	signed int deltaRed, deltaGreen, deltaBlue;

//	deltaRed = ((signed long) redB - (signed long) redA) / (signed long) steps;
//	deltaGreen = ((signed long) greenB - (signed long) greenA) / (signed long) steps;
//	deltaBlue = ((signed long) blueB - (signed long) blueA) / (signed long) steps;

//	for (i = 0; i < steps; i++) 
//	{
//		setLED_ColorWipe(redA + i * deltaRed, greenA + i * deltaGreen,	+blueA + i * deltaBlue);
//	
//		delay(time / steps);
//	}
//}

void getCircularRing(uint16_t time, uint8_t red, uint8_t green,uint8_t blue) 
{
	uint8_t index = 0 ;

	for (index = 0; index < LED_NUM; index++) 
	{
		setLED_ColorWipe(0, 0, 0);
		
		setLED_Color(index, red, green, blue);

    	setLED_Display(LED_DATA_LEN);

		delay_ms(time);
	}
}

// the interval should be in the 300-1000 range for best visual effect
//void getHeartBeat(uint16_t time, uint8_t red, uint8_t green,uint8_t blue) 
//{
//	uint8_t redInc, greenInc, blueInc;
//	uint8_t maxRed, maxGreen, maxBlue;

//	uint8_t index = 0 ;
//	uint8_t beatcnt = 35 ;
//	
//	redInc = red / HEARTBEAT_STEPS;
//	greenInc = green / HEARTBEAT_STEPS;
//	blueInc = blue / HEARTBEAT_STEPS;

//	maxRed = redInc * (HEARTBEAT_STEPS - 1);
//	maxGreen = greenInc * (HEARTBEAT_STEPS - 1);
//	maxBlue = blueInc * (HEARTBEAT_STEPS - 1);

//	setLED_ColorWipe(0, 0, 0);

//	// first stroke
//	for (index = 0; index < HEARTBEAT_STEPS; index++) 
//	{
//		setLED_ColorWipe(index * redInc, index * greenInc, index * blueInc);
//	
//		delay(time / (beatcnt+15));	//50
//	}
//	for (index = 0; index < HEARTBEAT_STEPS; index++) 
//	{
//		setLED_ColorWipe(maxRed - index * redInc, maxGreen - index * greenInc,maxBlue - index * blueInc);
//		
//		delay(time / (beatcnt+10));	//45
//	}
//	
//	// second stroke
//	for (index = 0; index < HEARTBEAT_STEPS; index++) 
//	{
//		setLED_ColorWipe(index * redInc, index * greenInc, index * blueInc);
//		
//		delay(time / (beatcnt+5));	//40
//	}
//	for (index = 0; index < HEARTBEAT_STEPS; index++) 
//	{
//		setLED_ColorWipe(maxRed - index * redInc, maxGreen - index * greenInc,maxBlue - index * blueInc);
//		
//		delay(time / (beatcnt));	//35
//	}
//	// relax..
//	delay_ms(time);

//}

#if defined (ENABLE_EXTRA_DEMO)
void getAllColors(uint16_t time) 
{
	uint16_t index = 0 ;
	uint8_t led = 0;

	for (index = 0;index < 766;index++)
	{
		#if 1
		for (led = 0; led < LED_NUM; led++)
		{
			setLED_Color(led,colorsFull[index][0],colorsFull[index][1],colorsFull[index][2]);			
		}
	
		#else
		for (led = 0; led < LED_NUM; led++)
		{
			setLED_Color(led,colorsFull[index + led][0],colorsFull[index + led][1],colorsFull[index + led][2]);
			
		}
	
		if ((index + led) >= 766)
			index = 0;
		#endif

		setLED_Display(LED_DATA_LEN);
		
		delay_ms(time);
	}
}

//void getColorWheel(uint16_t time) 
//{
//	uint16_t index = 0 ;
//	uint8_t led = 0, colorIndex = 0;

//	for (led = 0; led < LED_NUM; led++) 
//	{
//		colorIndex = (index + led * (766 / LED_NUM)) % 766;
//		
//		setLED_Color(led, colorsFull[colorIndex][0],	colorsFull[colorIndex][1], colorsFull[colorIndex][2]);

//		setLED_Display(LED_DATA_LEN);

//		delay_ms(time);	

