released/MS51_RGBLED/Sample_Code/Template/Project/main.c
//		index += (766 / LED_NUM);
//		index %= 766;		
//	}
//}
#endif /*ENABLE_EXTRA_DEMO*/

void getPatternMove(uint16_t time, uint16_t parts, uint8_t red,uint8_t green, uint8_t blue) 
{
	uint8_t index = 0 ;
	uint16_t indexStep;
	uint16_t i;

	indexStep = LED_NUM / parts;

	setLED_ColorWipe(0, 0, 0);

	for (index = 0; index < LED_NUM; index++) 
	{
		setLED_ColorWipe(0, 0, 0);
		
		for (i = 0; i < parts; i++)
		{
			setLED_Color(index + i * indexStep, red, green, blue);
		}

		setLED_Display(LED_DATA_LEN);
		
		delay_ms(time);
	}	
}

void getFullEmpty(uint16_t time, uint8_t red, uint8_t green,uint8_t blue) 
{
	uint8_t index = 0 ;

	setLED_ColorWipe(0, 0, 0);

	for (index = 0; index < LED_NUM; index++) 
	{
		setLED_Color(index, red, green, blue);

		setLED_Display(LED_DATA_LEN);
		
		delay_ms(time);
	}

	for (index = 0; index < LED_NUM; index++) 
	{
		setLED_Color(index,0, 0, 0);

		setLED_Display(LED_DATA_LEN);
		
		delay_ms(time);
	}
}

void getAlternateColors(uint16_t time, uint16_t steps,
		uint8_t redA, uint8_t greenA, uint8_t blueA, 
		uint8_t redB, uint8_t greenB, uint8_t blueB) 
{
	uint16_t i = 0;
	signed long  deltaRed, deltaGreen, deltaBlue;

	deltaRed = ((signed long) redB - (signed long) redA) / steps;
	deltaGreen = ((signed long) greenB - (signed long) greenA) / steps;
	deltaBlue = ((signed long) blueB - (signed long) blueA) / steps;

	for (i = 0; i < steps; i++) 
	{
		setLED_ColorWipe(redA + i * deltaRed, greenA + i * deltaGreen,	+blueA + i * deltaBlue);

		delay(time / steps);
	}
	for (i = steps - 1; i > 0; i--) 
	{
		setLED_ColorWipe(redA + i * deltaRed, greenA + i * deltaGreen,	+blueA + i * deltaBlue);
		
		delay(time / steps);
	}
}


void getRGBSequence(uint16_t time) 
{
	static uint8_t intensity = 0;
	static uint8_t sign = 0;

    uint8_t i = 0;
    if (sign) 
	{
        intensity++;
        if (intensity == 255) 
            sign = 0; 
    }
    else 
	{
        intensity--;
        if (intensity == 0)
            sign = 1;
    }

    for (i = 0; i < LED_NUM; i++) 
	{
        setLED_Color(i, intensity*((i%3)%2),intensity*(((i+1)%3)%2),intensity*(((i+2)%3)%2));

	    setLED_Display(LED_DATA_LEN);
		
	    delay(time);			
    }

}

void getTheaterChaseRainbow(uint16_t time) 
{
	uint16_t j = 0;
	uint8_t q = 0; 
	uint16_t i=0;
	uint8_t red , green, blue = 0;
	
	for (j=0; j < 256; j++) 
	{     // cycle all 256 colors in the wheel
		for (q=0; q < 3; q++) 
		{
			for (i=0; i < LED_NUM ; i=i+3) 
			{				
				_stripEffect_Wheel(( (i+j) % 255),&red,&green,&blue);
				setLED_Color(i+q, red,green,blue);
			
//				setLED_Color(i+q, 
//					UNPACK_R(_stripEffect_Wheel( (i+j) % 255)),
//					UNPACK_G(_stripEffect_Wheel( (i+j) % 255)),
//					UNPACK_B(_stripEffect_Wheel( (i+j) % 255)));    //turn every third pixel on
			}
			setLED_Display(LED_DATA_LEN);

			delay_ms(time);

			for (i=0; i < LED_NUM ; i=i+3) 
			{
				setLED_Color(i+q, 0 , 0 , 0);        //turn every third pixel off
			}
		}
	}
}

void getTheaterChase(uint16_t time ,uint8_t RED, uint8_t GREEN, uint8_t BLUE) 
{
	uint16_t j = 0;
	uint16_t q = 0;
	uint16_t i = 0;

	for (j=0; j<10; j++) 
	{  //do 10 cycles of chasing
		for (q=0; q < 3; q++) 
		{
			for (i=0; i < LED_NUM; i=i+3) 
			{
				setLED_Color(i+q, RED,GREEN,BLUE);    //turn every third pixel on
			}
			setLED_Display(LED_DATA_LEN);

			delay_ms(time);

			for (i=0; i < LED_NUM; i=i+3) 
			{
				setLED_Color(i+q, 0 , 0 , 0);        //turn every third pixel off
			}
		}
	}
}


void getRainbowCycle(uint8_t cycle , uint16_t time) 
{
	uint16_t i = 0, j = 0;
	uint8_t red , green, blue = 0;
	
	for(j=0; j<256*cycle; j++) 
	{ 
		// 5 cycles of all colors on wheel
		for(i=0; i< LED_NUM; i++) 
		{
			_stripEffect_Wheel((((i * 256 / LED_NUM) + j) & 255),&red,&green,&blue);
			setLED_Color(i,red,green,blue);
		
//			setLED_Color(i, 
//				UNPACK_R(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)),
//				UNPACK_G(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)),
//				UNPACK_B(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)));
		}
		
		setLED_Display(LED_DATA_LEN);

		delay_ms(time);
	}
}

void getRainbow(uint16_t time)
{
	uint8_t i = 0;
	uint8_t red , green, blue = 0;

	for (i=0;i<LED_NUM;i++)
	{
		_stripEffect_Rainbow(&red,&green,&blue);
		setLED_Color(i,red,green,blue); // Output a colour Format: GGRRBB							
	}
	
	// Now send out the bits to the SPI bus
	setLED_Display(LED_DATA_LEN);  	

	delay_ms(time);	
}

void getBreathing(uint16_t time)
{
	uint8_t i = 0;
	uint16_t j = 0;
	static uint8_t flag = 1;
	uint8_t led = 0;
	uint16_t index = 0 ;
	uint8_t red,green,blue = 0;

	red = colorsFull[index][0];
	green = colorsFull[index][1];
	blue = colorsFull[index][2];
	
	if (flag)
	{
		for (led = 0; led < LED_NUM; led++)
		{
			setLED_Color(led,red,green,blue);			
		}
		setLED_Display(LED_DATA_LEN);
		delay_ms(time);	
		flag = 0;
	}
	else
	{
		for (j=0xFF;j>0x7F;j--)
		{
			setLED_ColorWipe(j,j,j);
			delay_ms(time);
		}
		flag = 1;
	}

	if ((index++) > 766)
	{
		index = 0;
	}
	
}

void SimpleTest(void)
{
//	uint16_t i = 0;
//	static uint8_t flag = 1;
//	if (flag)
//	{
//		for (i = 0x00 ;i < 0xFF; i++)
//		{
//			setLED_ColorWipe(i,i,i);
//			delay_ms(60);
//		}
//		flag = 0;
//	}
//	else
//	{
//		for (i = 0xFF ;i > 0x00; i--)
//		{
//			setLED_ColorWipe(i,i,i);
//			delay_ms(60);
//		}		
//		flag = 1;
//	}

//	PWMx_CHx_SetDuty(WS_PWM_HIGH);
//	delay_ms(50);

//	PWMx_CHx_SetDuty(WS_PWM_LOW);
//	delay_ms(50);

//	setLED_BufferClear();
//	setLED_ColorWipe(0xFF, 0x00, 0x00);
//	setLED_Color(0, 0xFF, 0x00, 0x00);
//	setLED_Display(LED_DATA_LEN);
//	delay_ms(300);
//	setLED_ColorWipe(0x00, 0x00, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0xFF, 0x00, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0x00, 0xFF, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0x00, 0x00, 0xFF);
//	delay_ms(1500);	
//	setLED_ColorWipe(0x00, 0xFF, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0xFF, 0x00, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0x00, 0xFF, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0x00, 0x00, 0xFF);
//	delay_ms(1500);		
//	setLED_ColorWipe(0x00, 0x00, 0x00);
//	delay_ms(1500);
//	setLED_ColorWipe(0xFF, 0xFF, 0xFF);
//	delay_ms(1500);

//	GPIO_WS2812C_Send_1bit(1);
//	delay_ms(1);
//	GPIO_WS2812C_Send_1bit(0);
//	delay_ms(5);

	
//	delay(1);
//	P00 = 0;
//	delay(1);
//	P00 = 1;

