released/MS51_RGBLED/Sample_Code/Template/Project/main.c
//	setLED_ColorWipe(0xFF, 0x00, 0x00);
//	delay_ms(1500);

//	getBreathing(30);
	
//	getRainbow(30);	//OK
//	getRainbowCycle(1 ,5);//OK
//	getTheaterChase(60,0x3F,0x3F,0x00);//OK
//	getTheaterChaseRainbow(1);//OK
//	getRGBSequence(3);//OK
//	getAlternateColors(50, 16, 0xFF, 0, 0, 0, 0, 0xFF);//OK
//	getFullEmpty(30, 0x3F, 0x3F, 0x3F);//OK
//	getPatternMove(30, 1, 0x3F, 0x3F, 0x00);//OK
//	getHeartBeat(1000, HEARTBEAT_STEPS*4, HEARTBEAT_STEPS*0, HEARTBEAT_STEPS*2);
//	getCircularRing(30, 0xFF, 0xFF, 0xFF);
//	getFromAToB(3, 4, 0x3F, 0, 0, 0xFF, 0, 0xFF);
//	getColorWheel(5);
	getAllColors(1);
			
//	setLED_ColorWipe(0xFF, 0xFF, 0xFF);//test
//	SPI_Send_Data(0x01);

//	setLED_ColorWipe(0xFF,0xFF,0xFF);
//	delay_ms(300);	
//	setLED_ColorWipe(0x00,0x00,0x00);
//	delay_ms(300);	
		
}

void StateMachine(void)
{

	if (DemoState++ >= state_Max)
	{
		DemoState = state_Default+1;
	}

	#if defined (ENABLE_UART0_LOG)
	printf("demo : 0x%X\r\n",DemoState);
	#endif

	switch(DemoState)
	{
		case state_Rainbow:
			getRainbow(50);
			break;

		case state_RainbowCycle:
			getRainbowCycle(1 ,5);	//(5 , 1000);
			break;

		case state_TheaterChase:
			getTheaterChase(60,0xFF,0x00,0x00);
//			getTheaterChase(60,0x00,0xFF,0x00);
//			getTheaterChase(60,0x00,0x00,0xFF);
		
			break;

		case state_TheaterChaseRainbow:
			getTheaterChaseRainbow(1);
			break;

		case state_RGBSequence:
			getRGBSequence(3);
			break;
		
		case state_AlternateColors:
			getAlternateColors(50, 16, 0xFF, 0, 0, 0, 0, 0xFF);
			break;

		case state_FullEmpty:
			getFullEmpty(30, 0x3F, 0x3F, 0x3F);
			break;
		
		case state_PatternMove:
			getPatternMove(30, 1, 0x3F, 0x3F, 0x00);
			break;

		#if defined (ENABLE_EXTRA_DEMO)
//		case state_ColorWheel:	//not obviously
//			getColorWheel(5);	
//			break;

		case state_AllColors:
			getAllColors(1);	
			break;
		#endif	/*ENABLE_EXTRA_DEMO*/

//		case state_HeartBeat:	//not obviously
//			getHeartBeat(700, 64, 0, 16);
//			break;	

		case state_CircularRing:
			getCircularRing(30, 0, 0, 20);
			break;	
		
//		case state_FromAToB:	//not obviously
//			getFromAToB(3, 4, 0x3F, 0, 0, 0xFF, 0, 0xFF);
//			break;	
			
	}

	delay_ms(DEMO_MS);
}

#if defined (ENABLE_GPIO_DEMO)
void GPIO_Toggle(void)
{
    P12 ^= 1;
}

void GPIO_Init(void)
{
//    P12_PUSHPULL_MODE;
    P13_PUSHPULL_MODE;	
	P14_PUSHPULL_MODE;	
}
#endif

#if defined (ENABLE_UART0_LOG)
void SendString(uint8_t* Data)
{
	#if 1
	uint16_t i = 0;

	while (Data[i] != '\0')
	{
		UART_Send_Data(UART0,Data[i++]);		
	}

	#endif

	#if 0
	uint16_t i = 0;
	
	for(i = 0;i< (strlen(Data)) ;i++ )
	{
		UART_Send_Data(UART0,Data[i]);
	}
	#endif

	#if 0
    while(*Data)  
    {  
        UART_Send_Data(UART0, (unsigned char) *Data++);  
    } 
	#endif
}


void UART0_Init(void)
{
    UART_Open(SYS_CLOCK,UART0_Timer3,115200);
    ENABLE_UART0_PRINTF;
}
#endif

#if defined (ENABLE_TIMER0_1MS_IRQ)
void Timer0_IncCnt(void)
{
	u16Cnt++;
}

void Timer0_SetCnt(uint16_t res)
{
	u16Cnt = res;
}

uint16_t Timer0_GetCnt(void)
{
	return u16Cnt;
}

void Timer0_IRQHandler(void)
{
//	static uint16_t LOG_TIMER = 0;
//	static uint16_t CNT_TIMER = 0;
//	static uint16_t CNT_GPIO = 0;
//	static uint16_t CNT_DEMO = 0;

//	if (CNT_GPIO++ >= GPIO_TOGGLE_MS)
//	{		
//		CNT_GPIO = 0;
//		#if defined (ENABLE_GPIO_DEMO)
//		GPIO_Toggle();
//		#endif
//	}	

//	if (CNT_TIMER++ >= TIMER_LOG_MS)
//	{		
//		CNT_TIMER = 0;
//    	printf("LOG:%d\r\n",LOG_TIMER++);
//    	printf("u16DataAdjust:%d\r\n",u16DataAdjust);
//		SendString("LOG_TIMER\r\n");
//	}

//	if (CNT_DEMO++ >= DEMO_MS)
//	{		
//		CNT_DEMO = 0;		
//	}	

	if (Timer0_GetCnt()>=1)
	{
		Timer0_IncCnt();
	}

}

void Timer0_ISR(void) interrupt 1        // Vector @  0x0B
{
    TH0 = u8TH0_Tmp;
    TL0 = u8TL0_Tmp;
    clr_TCON_TF0;
	
	Timer0_IRQHandler();
}

void BasicTimer_TIMER0_Init(void)
{
	uint16_t res = 0;

	ENABLE_TIMER0_MODE1;
	
	u8TH0_Tmp = HIBYTE(TIMER_DIV12_VALUE_1ms_FOSC_240000);
	u8TL0_Tmp = LOBYTE(TIMER_DIV12_VALUE_1ms_FOSC_240000); 

    TH0 = u8TH0_Tmp;
    TL0 = u8TL0_Tmp;

    ENABLE_TIMER0_INTERRUPT;                       //enable Timer0 interrupt
    ENABLE_GLOBAL_INTERRUPT;                       //enable interrupts
  
    set_TCON_TR0;                                  //Timer0 run
}
#endif

void SYS_Init(void)
{
	MODIFY_HIRC_24();

    ALL_GPIO_QUASI_MODE;
    ENABLE_GLOBAL_INTERRUPT;                // global enable bit	
}

void main (void) 
{
    SYS_Init();

	#if defined (ENABLE_UART0_LOG)
    UART0_Init();
	#endif

	#if defined (ENABLE_GPIO_DEMO)
	GPIO_Init();					//P12 , GPIO
	#endif

	#if defined (ENABLE_PWM_TRIG_LED)
	PWMx_CHx_Init();
	#elif defined (ENABLE_SPI_TRIG_LED)	
	SPI_Initial(SPI_6M);
	#elif defined (ENABLE_GPIO_TRIG_LED)
	GPIO_WS2812C_Initial();
	#endif
	

	#if defined (ENABLE_TIMER0_1MS_IRQ)
	BasicTimer_TIMER0_Init();
	#endif
//		
    while(1)
    {		
		StateMachine();
//		SimpleTest();		
    }
}



